wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
void setled(byte n, byte r, byte g, byte b, byte show) {
  if (has_white && r==g && r==b) {
    if (r < 255)
      led.setPixelColor(n, 0, 0, 0, r);
    else
      led.setPixelColor(n, 255, 255, 255, 255);
  } else {
    led.setPixelColor(n, r, g, b);
  }
  if (light_on && show) {
    led.show();
  }
}

void setledcolor(byte n, uint32_t color, byte show) {
  byte r,g,b;
  b = color & 0xff;
  g = (color >> 8) & 0xff;
  r = (color >> 16) & 0xff;
  // w = (color >> 24) & 0xff;
  setled(n,r,g,b,show);
}

void setled(byte show) {
  if (!show) {
    int i;
    for (i = 0; i < nrofleds; i++) {
      setled(i, 0, 0, 0, 0);
    }
  }
  led.show();
}

// Debug functions
void log_config () {

  Log.verbose("Smyname = %s",Smyname.c_str());
  Log.verbose("Ssite = %s",Ssite.c_str());
  Log.verbose("Sroom = %s",Sroom.c_str());
  Log.verbose("Sssid = %s",Sssid.c_str());
  Log.verbose("Spass = %s",Spass.c_str());
  Log.verbose("Smqttuser = %s",Smqttuser.c_str());
  Log.verbose("Smqttpass = %s",Smqttpass.c_str());
  Log.verbose("Imqttport = %d",Imqttport);
  Log.verbose(F("Bflipped = %t"),Bflipped);
  Log.verbose(F("Bindoor = %t"),Bindoor);
  Log.verbose(F("Display = %d"),display_what);
  Log.verbose(F("Brightness = %d"),display_brightness);
  if (pir_found)
    Log.verbose(F("Motion detector = %d"),pirInput);
  Log.verbose(F("AS3935 int pin = %d"),as3935_input);
  Log.verbose(F("AS3935 tune cap = %d"),as3935_tunecap);
  Log.verbose(F("nrofleds = %d"),nrofleds);
  Log.verbose(F("ledtype = %x"),ledtype);
  Log.verbose(F("CO2alert = %t"),Bco2alert);

}

void write_config () {
  StaticJsonDocument<512> doc;
  doc["myname"] = Smyname;
  JsonObject display = doc.createNestedObject("display");
  display["flipped"] = Bflipped;
  display["brightness"] = display_brightness;
  display["content"] =display_what;
  JsonObject network = doc.createNestedObject("network");
  network["pass"] = Spass;
  network["ssid"] = Sssid;
  JsonObject mqtt = doc.createNestedObject("mqtt");
  mqtt["server"] = Smqttserver;
  mqtt["user"] = Smqttuser;
  mqtt["pass"] = Smqttpass;
  mqtt["port"] = Imqttport;
  JsonObject location = doc.createNestedObject("location");
  location["site"] = Ssite;
  location["room"] = Sroom;
  location["indoor"] = Bindoor;

  JsonObject clock = doc.createNestedObject("clock");
  clock["enabled"] = clock_enabled;
  clock["timezone"] = clock_timezone;
  clock["dst"] = clock_dst;
  clock["hourcolor"] = hourcolor;
  clock["minutecolor"] = minutecolor;
  clock["secondcolor"] = secondcolor;
  clock["hourtickcolor"] = hourtickcolor;
  clock["topled"] = clock_topled;

  JsonObject sensors = doc.createNestedObject("sensors");

  if (bme280_found) {
    JsonObject bme280 = sensors.createNestedObject("bme280");
    bme280["tempadjust"] = bme280TempAdjust;
  }

  if (bme680_found) {
    JsonObject bme680 = sensors.createNestedObject("bme680");
    bme680["tempadjust"] = bme680TempAdjust;
  }

  if (si7021_found) {
    JsonObject si7021 = sensors.createNestedObject("si7021");
    si7021["tempadjust"] = si7021TempAdjust;
  }

  if (pir_found) {
    JsonObject pir;
    pir = sensors.createNestedObject("pir");
    pir["pin"] = pirInput;
  }

  if (as3935_found || as3935_inconfig) {
    JsonObject as3935 = sensors.createNestedObject("as3935");
    as3935["input"] = as3935_input;
    as3935["tunecap"] = as3935_tunecap;
  }

  JsonObject leds;
  leds = doc.createNestedObject("led");
  leds["count"] = nrofleds;
  leds["type"] = ledtype;

  doc["co2alert"] = Bco2alert;


  Log.notice(F("Writing new config file"));
  serializeJsonPretty(doc,Serial);

  SPIFFS.begin();
  File f = SPIFFS.open("/config.json","w");
  if (!f) {
    Log.error(F("Open of config file for writing failed"));
  } else {
    if (serializeJson(doc,f)) {
      Log.notice(F("Written new config. Now reboot"));
    } else {
      Log.error(F("Writing object into file failed"));
    }
    f.close();
  }
SPIFFS.end();
}

// Logging helper routines
void printTimestamp(Print* _logOutput) {
  char c[12];
  sprintf(c, "%10lu ", millis());
  _logOutput->print(c);
}

void printNewline(Print* _logOutput) {
  _logOutput->print('\n');
}

// MQTT main callback routines
void mqtt_callback(char* topic, byte* payload, unsigned int length)  {

  String in[10];
  unsigned int wordcounter = 0;

  for (unsigned int i = 0; i < length; i++) {
    if ((char)payload[i] == ' ' && wordcounter < 9) {
      wordcounter++;
    } else {
      in[wordcounter] += String((char)payload[i]);
    }
  }
  Log.verbose("Message arrived[%s]: %d Words",topic,wordcounter);
  for (unsigned int i=0; i <= wordcounter; i++)
    Log.verbose("Word[%d] = %s",i,in[i].c_str());

  if (in[0] == "reboot") {
    ESP.restart();
  }

  if (in[0] == "status") {
    publish_status();
  }

  if (in[0] == "led") {
    if (wordcounter == 2) {
      // led brightness x
      if (in[1] == "brightness") {
        Log.notice(F("Brightness: %d"),led.getBrightness());
        led.setBrightness(in[2].toInt());
        Log.notice(F("Brightness: %d"),led.getBrightness());
      }
      else if (in[1] == "temperature") {
        //led temperature 25.3
        display_temperature(in[2].toInt());
      }
      else if (in[1] == "humidity") {
        display_humidity(in[2].toInt());
      }
    }
    else if (wordcounter == 3) {
      // led r g b
      setled(in[1].toInt(),in[2].toInt(),in[3].toInt());
    } else if (wordcounter == 4) {
      setled(in[1].toInt(),in[2].toInt(),in[3].toInt(),in[4].toInt());
    }
  }

  if (in[0] == "ledb") {
    // led in binary code
    unsigned int position = 5;
    int thisled = 0;
    while ((position < length-3) && (thisled < nrofleds)) {
      // 3 bytes per led: red green blue
      setled(thisled,
        payload[position],
        payload[position+1],
        payload[position+2],
        0);
      position +=3;
      thisled++;
    }
    setled(1); // show result
  }

  if (in[0] == "ledfade") {
    // fade from current led state to new one
    bool complete = false;
    while (!complete) {
      unsigned int position = 8;
      int thisled = 0;
      complete = true;
      while ((position < length-3) && (thisled < nrofleds)) {
        uint32_t currentColor;
        byte cR, cG, cB;
        currentColor = led.getPixelColor(thisled);
        cB = currentColor & 0xff;
        currentColor >>= 8;
        cG = currentColor & 0xff;
        currentColor >>= 8;
        cR = currentColor & 0xff;

        if (cR > payload[position]) {
          cR--; complete = false;
        }
        else if (cR < payload[position]) {
          cR++; complete = false;
        }

