wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
        if (cG > payload[position+1]) {
          cG--; complete = false;
        }
        else if (cG < payload[position+1]) {
          cG++; complete = false;
        }

        if (cB > payload[position+2]) {
          cB--; complete = false;
        }
        else if (cB < payload[position+2]) {
          cB++; complete = false;
        }

        if (!complete) {
          setled(thisled,cR,cG,cB,0);
        }
        position += 3;
        thisled++;
      }
      setled(1);
    }
  }

  if (in[0] == "leds") {
    // apply to all leds
    if (wordcounter == 3) {
      setallleds(in[1].toInt(),in[2].toInt(),in[3].toInt());
    }
  }

  if (in[0] == "sensor") {
    // sensor name command
    if (wordcounter >= 1) {
      if (tcs_found && in[1] == "color") {
        if (wordcounter == 1) {
          loop_publish_tcs34725();
        }
        if (wordcounter == 2) {
          if (in[2] == "enable")
            color_watch = 1;
          if (in[2] == "disable")
            color_watch = 0;
        }
        if (wordcounter == 3) {
          if (in[2] == "gain") {
            tcs.setGain((tcs34725Gain_t) atoi(in[3].c_str()));
          }
          if (in[2] == "time") {
            tcs.setIntegrationTime((tcs34725IntegrationTime_t) atoi(in[3].c_str()));
            tcs.begin();
          }
          if (in[2] == "interrupt") {
            tcs.setInterrupt(in[3] == "on");

          }
        }
      }
      if (as3935_found && in[1] == "as3935") {
        if (wordcounter == 1) {
          publish_as3935();
        }
        if (wordcounter == 3) {
          if (in[2] == "tunecap") {
            as3935.tuneCap((uint8_t) atoi(in[3].c_str()));
            delay(50);
            as3935_tunecap = as3935.readTuneCap();
            Log.verbose(F("as3935 tuning capacitor now %d"),
              as3935_tunecap);
          }
        }
      }
      if (bme280_found && in[1] == "bme280") {
        if (wordcounter == 1) {
          publish_bme280();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          bme280.setTemperatureCompensation(atof(in[3].c_str()));
          bme280TempAdjust = bme280.getTemperatureCompensation();
          publish_bme280();
        }
      }

      if (bme680_found && in[1] == "bme680") {
        if (wordcounter == 1) {
          publish_bme680();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          bme680TempAdjust = atof(in[3].c_str());
          #if defined (BME680Bosch)
          iaqSensor.setTemperatureOffset(-1.0 * bme680TempAdjust);
          #endif
          publish_bme680();
        }
      }


      if (si7021_found && in[1] == "si7021") {
        if (wordcounter == 1) {
          publish_si7021();
        }
        if (wordcounter == 3 && in[2] == "tempadjust") {
          si7021TempAdjust = atof(in[3].c_str());
          publish_si7021();
        }
      }
    }
  }

  if (wordcounter >= 1 && in[0] == F("countdown")) {
    countdown_mode = true;

    if (wordcounter == 1 and in[1] == "cancel") {
      countdown_mode = false;
    }
    // clock countdown seconds
    else if (wordcounter == 1) {
      countdown_until = millis() + in[1].toInt()*1000;
    }
    // clock countdown minutes seconds
    else if (wordcounter == 2) {
      countdown_until = millis() +
        in[1].toInt()*60*1000 +
        in[2].toInt()*1000;
    }
    else if (wordcounter == 3) {
      countdown_until = millis() +
        in[1].toInt()*60*60*1000 +
        in[2].toInt()*60*1000 +
        in[3].toInt()*1000;
    } else {
      countdown_mode=false;
    }
  }

  if (in[0] == F("clock") && rtc_found) {
    if (wordcounter >= 1) {
      if (in[1] == F("enable")) {
        // clock enable
        clock_enabled = true;
      }
      if (in[1] == F("disable")) {
        // clock disable
        if (clock_enabled)
          setallleds(0, 0, 0);
        clock_enabled = false;
      }
    }
    if (wordcounter == 3 && in[1] == F("color")) {
      if (in[2] == F("hour"))
        hourcolor = atol(in[3].c_str());
      if (in[2] == F("minute"))
        minutecolor = atol(in[3].c_str());
      if (in[2] == F("second"))
        secondcolor = atol(in[3].c_str());
      if (in[2] == F("tick"))
        hourtickcolor = atol(in[3].c_str());

    }
    if (wordcounter > 0 && in[1] == F("set")) {
      // clock set year month day hour minute second
      if (wordcounter == 7) {
        rtc.adjust(DateTime(
          atoi(in[2].c_str()), // year
          atoi(in[3].c_str()), // month
          atoi(in[4].c_str()), // day
          atoi(in[5].c_str()), // hour
          atoi(in[6].c_str()), // minute
          atoi(in[7].c_str()))); // second
      }
    }
  }

  if (in[0] == F("config")) {
    if (wordcounter == 0) {
      log_config();
    }
    if (wordcounter == 1) {
      if (in[1] == F("write")) {
        log_config();
        write_config();
      }
    }
    if (wordcounter == 2) {
      if (in[1] == F("room")) {
        Sroom = in[2];
      }
      if (in[1] == F("site")) {
        Ssite = in[2];
      }
      if (in[1] == F("myname")) {
        Smyname = in[2];
      }
      if (in[1] == F("mqttuser")) {
        Smqttuser = in[2];
      }
      if (in[1] == F("mqttpass")) {
        Smqttpass = in[2];
      }
    }
  }

  if (u8x8_found && (in[0] == "display") && (wordcounter >= 1)) {
    last_display = 0;
    display_refresh = true;
    if (in[1] == "humidity") {
      display_what = DISPLAY_HUMIDITY;
    } else if (in[1] == "airpressure") {
      display_what = DISPLAY_AIRPRESSURE;
    } else if (in[1] == F("temperature")) {
      display_what = DISPLAY_TEMPERATURE;
    } else if (in[1] == F("distance")) {
      display_what = DISPLAY_DISTANCE;
    } else if (in[1] == F("temphum")) {
      display_what = DISPLAY_TEMPHUM;
    } else if (in[1] == F("co2")) {
      display_what = DISPLAY_CO2;
    } else if (in[1] == "off") {
      u8x8.clearDisplay();
      display_what = DISPLAY_OFF;
    } else if (in[1] == F("flip")) {
      u8x8.clearDisplay();
      u8x8.setFlipMode(wordcounter > 1);
      Bflipped = (wordcounter > 1);
    } else if (in[1] == F("brightness") && wordcounter >= 2) {
      display_brightness = in[2].toInt();
      Log.verbose(F("Setting brightness to %d"),display_brightness);
      u8x8.setContrast(display_brightness);
    } else { // String
      // large or small?
      // small, if a line is longer than 8 chars or if there are more than 3 lines
      boolean large = true;
      int start;
      for (unsigned int i=1; i<=wordcounter;i++) {
        if (in[i].length() > 8)
          large = false;
      }
      if (wordcounter > 3)
        large = false;

