wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
      if (wordcounter == 1)
        start = 3;
      else
        start = 0;

      display_what = DISPLAY_STRING;
      u8x8.setFont(u8x8_font_amstrad_cpc_extended_r);
      u8x8.clearDisplay();

      for (unsigned int i=1; i <= wordcounter; i++) {
        if (large) {
          u8x8.draw2x2UTF8(0, start, in[i].c_str());
          start += 3;
        } else {
          u8x8.draw1x2UTF8(0, start, in[i].c_str());
          start += 2;
        }
      }
    }
  }
}

boolean mqtt_reconnect() {
  // Loop until we're reconnected
  char mytopic[50];
  snprintf(mytopic, 50, "/%s/%s/status", Ssite.c_str(), Sroom.c_str());

  if (WiFi.status() != WL_CONNECTED) {
    if (!setup_wifi())
      return false;
  }

  Log.verbose("Attempting MQTT connection...%d...",client.state());

  // Attempt to connect
  if (client.connect(Smyname.c_str(),Smqttuser.c_str(),Smqttpass.c_str(),mytopic,0,0,"stopped")) {
    Log.verbose("MQTT connected");

    client.publish(mytopic, "started");
    delay(10);
    // ... and resubscribe to my name
    client.subscribe(Smyname.c_str());
    // and to my location
    String mylocation = "/" + Ssite + "/cmd";
    client.subscribe(mylocation.c_str());
    String myroom = "/" + Ssite + "/" + Sroom + "/cmd";
    client.subscribe(myroom.c_str());
    delay(10);
  } else {
    Log.error("MQTT connect failed, rc=%d",client.state());
  }
  return client.connected();
}

unsigned long lastReconnectAttempt = 0;
void mqtt_publish(char *topic, char *msg) {
  if (!client.connected()) {
    long now = millis();
    if (now - lastReconnectAttempt > 5000) {
      lastReconnectAttempt = now;
      if (mqtt_reconnect()) {
        lastReconnectAttempt = 0;
      }
    }
  }
  client.loop();


  char mytopic[50];
  snprintf(mytopic, 50, "/%s/%s/%s", Ssite.c_str(), Sroom.c_str(),topic);
  Log.verbose("MQTT Publish message [%s]:%s",mytopic,msg);

  client.publish(mytopic, msg);
}

void mqtt_publish(const __FlashStringHelper *topic, const __FlashStringHelper *msg) {
  char a[64],b[64];
  snprintf(a,63,"%s",(char *)topic);
  snprintf(b,63,"%s",(char *)msg);
  mqtt_publish(a,b);
}

void mqtt_publish(const __FlashStringHelper *topic, char *msg) {
  char a[64];
  snprintf(a,63,"%s",(char *)topic);
  mqtt_publish(a,msg);
}

void mqtt_publish(const __FlashStringHelper *topic, const char *msg) {
  char buf[64];
  snprintf(buf,63,"%s",msg);
  mqtt_publish(topic, buf);
}


void mqtt_publish(char *topic, int i) {
  char buf[15];
  snprintf(buf,14,"%d",i);
  mqtt_publish(topic, buf);
}

void mqtt_publish(char *topic, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%u",i);
  mqtt_publish(topic,buf);
}

void mqtt_publish(const __FlashStringHelper *topic, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%u",i);
  mqtt_publish(topic,buf);
}

void mqtt_publish(char *topic, float value) {
  char buf[15];
  snprintf(buf,14,"%.3f",value);
  mqtt_publish(topic, buf);
}

void mqtt_publish(const __FlashStringHelper *topic, float value) {
  char buf[15];
  snprintf(buf,14,"%.3f",value);
  mqtt_publish(topic, buf);
}



void mqtt_influx(char *field, char *value) {
  char out[128];

  sprintf(out,"sensor,site=%s,room=%s %s=%s",
    Ssite.c_str(), Sroom.c_str(),field,value);
  mqtt_publish(F("influx"),out);
}

void mqtt_influx(char *field, int i) {
  char buf[15];
  snprintf(buf,14,"%di",i);
  mqtt_influx(field,buf);
}

void mqtt_influx(char *field, float f) {
  char buf[15];
  snprintf(buf,14,"%.3f",f);
  mqtt_influx(field,buf);
}

void mqtt_influx(char *field, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%u",i);
  mqtt_influx(field,buf);
}

void mqtt_influx(char *field, bool b) {
  if (b)
    mqtt_influx(field,F("true"));
  else
    mqtt_influx(field,F("false"));
}

void mqtt_influx(const __FlashStringHelper *topic, const __FlashStringHelper *msg) {
  char a[32],b[32];
  snprintf(a,31,"%s",(char *)topic);
  snprintf(b,31,"%s",(char *)msg);
  mqtt_influx(a,b);
}

void mqtt_influx(const __FlashStringHelper *topic, char *msg) {
  char a[32];
  snprintf(a,31,"%s",(char *)topic);
  mqtt_influx(a,msg);
}

void mqtt_influx(const __FlashStringHelper *topic, const char *msg) {
  char buf[32];
  snprintf(buf,31,"%s",msg);
  mqtt_influx(topic, buf);
}

void mqtt_influx(const __FlashStringHelper *topic, uint32_t i) {
  char buf[32];
  snprintf(buf,31,"%u",i);
  mqtt_influx(topic,buf);
}

void mqtt_influx(const __FlashStringHelper *topic, float f) {
  char buf[32];
  snprintf(buf,31,"%.3f",f);
  mqtt_influx(topic,buf);
}


// Setup routines
//
// Scan for sensors
//
void setup_i2c() {
  byte error, address;

// 0x03 AS3935 Lightning Detector
// 0x29 TSL45315 (Light)
// 0x29  Color
// 0x38 VEML6070 (Light)
// 0x39 TSL2561
// 0x3c Display
// 0x40 SI7021
// 0x48 4*AD converter ADS1115
// 0x4a GY49 or MAX44009 Light Sensor
// 0x50 PCF8583P
// 0x57 ATMEL732
// 0x5a CCS811 Gas Sensor
// 0x68 DS3231 Clock
// 0x76 BME280
// 0x77 BME680 (also BMP180)


  Log.notice("Scanning i2c bus");
  Wire.begin(I2CSDA, I2CSCL);
  Wire.setClock(10000);

  // Try for DISPLAY
#if defined(BOARD_HELTEC)
  pinMode(16,OUTPUT);
  digitalWrite(16,LOW);
  delay(100);
  digitalWrite(16,HIGH);
#endif

  for(address = 1; address < 127; address++ ) {
    Log.verbose(F("Trying %d"),address);
    Wire.beginTransmission(address);
    error = Wire.endTransmission();

    // force ok for Lightning sensor
    if (address == AS3935_ADDR && error != 0 && as3935_inconfig) {
      // force as3935 found
      Log.trace("AS3935 forced");
      error = 0;
    }

    if (error == 0) {
      Log.trace("I2C device found at address 0x%x",address);

      if (address == AS3935_ADDR) {
        as3935_found = as3935.begin();
        Log.notice(F("AS3935 found? %T"),as3935_found);
        if (as3935_found) {
          // initialize it
          // Are we indoor or outdoor?
          if (Bindoor) {
            as3935.setIndoorOutdoor(INDOOR);
          } else {
            as3935.setIndoorOutdoor(OUTDOOR);
          }
          // set default values (tune code later)
          as3935.maskDisturber(false);
          as3935.setNoiseLevel(1);
          as3935.watchdogThreshold(1);
          as3935.spikeRejection(2);
          as3935.lightningThreshold(5);
          as3935.tuneCap(as3935_tunecap);
          as3935.clearStatistics(true);
        }
      }

