wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
      if (address == 0x29) {
        tcs_found = tcs.begin();
        Log.notice(F("TCS found? %T"),tcs_found);

        if (!tcs_found) {
          lox_found = lox.begin();
          Log.notice(F("LOX found? %T"),lox_found);
        }
      }

      if (address == 0x39) {
        tsl2561 = Adafruit_TSL2561_Unified(address);
        tsl2561_found = tsl2561.begin();
        Log.notice("TSL2561 found? %T",tsl2561_found);
        if (tsl2561_found) {
          // init the sensor
          tsl2561.enableAutoRange(true);
          // tsl2561.setGain(TSL2561_GAIN_1X);
          tsl2561.setIntegrationTime(TSL2561_INTEGRATIONTIME_101MS);
        }
      }

      if (address == 0x38) {
        // VEML6070
        veml.begin(VEML6070_1_T);
        if (veml.readUV() != -1) {
          veml_found = true;
        }
        Log.notice(F("VEML6070 found? %T"), veml_found);
      }

      if (address == 0x3c) {
        u8x8_found = u8x8.begin();
        Log.notice("U8xu found? %T",u8x8_found);
        if (u8x8_found) {
          u8x8.clear();
          u8x8.setFont(u8x8_font_chroma48medium8_r);
          u8x8.setFlipMode(Bflipped);
        }
      }
      if (address == 0x40) {
        // SI7021
        si7021 = Adafruit_Si7021();
        si7021_found = si7021.begin();
        Log.notice("Si7021 found? %T",si7021_found);
      }

      if (address == 0x4a) {
        // GY-49
        float l = gy49.getLux();
        if (! gy49.getError()) {
          gy49_found = true;
          Log.notice(F("GY49 found at 0x%x, current Lux %F"),address,l);
        }
      }

      if ((address >= 0x48) && (address <= 0x4b) && (address != 0x4a)) {
        ads1115 = Adafruit_ADS1115(address);
        ads1115.begin();
        ads1115_found = true;
        Log.notice(F("ADS1115 found at 0x%x"),address);
      }

      if (address == 0x57) {
        // ATMEL732
      }

      if (address == 0x5a) {
        // CCS811 Gas Sensor
        if (ccs.begin()){
          ccs811_found = true;
          Log.notice(F("CCS811 found at 0x%x"),address);
          // driver mode 60 seconds is enough
          if (Bco2alert)
            ccs.setDriveMode(CCS811_DRIVE_MODE_1SEC);
          else
            ccs.setDriveMode(CCS811_DRIVE_MODE_60SEC);
        }
      }

      if (address == 0x68) {
        // DS3231 Clock
        if (rtc.begin()) {
          rtc_found = true;
          Log.notice(F("DS3231 RT found at 0x%x"),address);
          // check if power ok
          if (rtc.lostPower()) {
            rtc_timeok = false;
            Log.error(F("DS3231 lost power - set time"));
          } else {
            rtc_timeok = true;
            rtcnow = rtc.now();
            Log.notice(F("DS3231 time %d-%d-%d %d:%d:%d"),
              rtcnow.year(),rtcnow.month(),rtcnow.day(),
              rtcnow.hour(),rtcnow.minute(),rtcnow.second());
          }
        }
      }

      if (address == 0x76 || address == 0x77) {
        // BME280 or BME680
        #if defined(BME680Bosch)
        iaqSensor.begin(address,Wire);
        checkIaqSensorStatus();
        if (bme680_found) {
          Log.notice("BME680 found using Bosch? %T at 0x%x",bme680_found,address);
          bsec_virtual_sensor_t sensorList[12] = {
            BSEC_OUTPUT_IAQ,
            BSEC_OUTPUT_CO2_EQUIVALENT,
            BSEC_OUTPUT_STABILIZATION_STATUS,
            BSEC_OUTPUT_RUN_IN_STATUS,
            BSEC_OUTPUT_RAW_TEMPERATURE,
            BSEC_OUTPUT_RAW_PRESSURE,
            BSEC_OUTPUT_RAW_HUMIDITY,
            BSEC_OUTPUT_RAW_GAS,
            BSEC_OUTPUT_COMPENSATED_GAS,
            BSEC_OUTPUT_GAS_PERCENTAGE,
            BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_TEMPERATURE,
            BSEC_OUTPUT_SENSOR_HEAT_COMPENSATED_HUMIDITY
          };
          iaqSensor.updateSubscription(sensorList, 12, BSEC_SAMPLE_RATE_LP);
          iaqSensor.setTemperatureOffset(-1.0 * bme680TempAdjust);
        #else // Adafruit
        bme680_found = bme680.begin(address);
        if (bme680_found) {
          bme680.setTemperatureOversampling(BME680_OS_8X);
          bme680.setHumidityOversampling(BME680_OS_2X);
          bme680.setPressureOversampling(BME680_OS_4X);
          bme680.setIIRFilterSize(BME680_FILTER_SIZE_3);
          bme680.setGasHeater(320, 150); // 320*C for 150 ms
          Log.notice("BME680 found using Adafruit? %T at 0x%x",bme680_found,address);
        #endif
        } else {
          bme280_found = bme280.begin(address);
          Log.notice("BME280 found? %T at 0x%x",bme280_found,address);
          bme280.setTemperatureCompensation(bme280TempAdjust);
          Log.notice("BME280 adjustment %F",bme280TempAdjust);
        }
      }
    }
  }
  Log.notice("End scanning i2c bus");
}

void setup_serial() {
  delay(1000);
  Serial.begin(115200);
}

void setup_logging() {
  Log.begin(LOG_LEVEL_VERBOSE, &Serial);
  Log.setPrefix(printTimestamp);
  Log.setSuffix(printNewline);
  Log.verbose("Logging has started");
}

// we assume there is always a LED connected
void setup_led() {
  led.begin();
  led.show();
  has_white = (ledtype >> 6) != ((ledtype >> 4) & 0x03);
}

// setup PIR motion detector
void setup_pir() {
  pinMode(pirInput, INPUT);
  pirState = digitalRead(pirInput);
}

// read the config file and parse its data
void setup_readconfig() {
  SPIFFS.begin();
  File f = SPIFFS.open("/config.json","r");
  if (!f) {
    Log.error("Cannot open config file");
    return;
  }
  StaticJsonDocument<1024> jsonBuffer;

 // Parse the root object
 // JsonObject root = jsonBuffer.parseObject(f);

 auto error = deserializeJson(jsonBuffer,f);
 if (error) {
   Log.error(F("Failed to read file %s"),error.c_str());
 } else {
   serializeJsonPretty(jsonBuffer,Serial);
 }

 JsonObject root = jsonBuffer.as<JsonObject>();

 // Copy values from the JsonObject to the Config
   Smyname = root["myname"].as<String>();
   Bflipped = root["display"]["flipped"];
   display_what = root["display"]["content"];
   display_brightness=root["display"]["brightness"];
   Spass = root["network"]["pass"].as<String>();
   Sssid = root["network"]["ssid"].as<String>();
   Smqttserver = root["mqtt"]["server"].as<String>();
   Ssite = root["location"]["site"].as<String>();
   Sroom = root["location"]["room"].as<String>();
   Bindoor = root["location"]["indoor"];
   Smqttuser = root["mqtt"]["user"].as<String>();
   Smqttpass = root["mqtt"]["pass"].as<String>();
   Imqttport = root["mqtt"]["port"];

   bme280TempAdjust = root["sensors"]["bme280"]["tempadjust"];
   bme680TempAdjust = root["sensors"]["bme680"]["tempadjust"];
   si7021TempAdjust = root["sensors"]["si7021"]["tempadjust"];

   if ((as3935_input = root["sensors"]["as3935"]["input"])) {
     as3935_tunecap = root["sensors"]["as3935"]["tunecap"];
     as3935_inconfig = true;
   }
   if ((nrofleds = root["led"]["count"])) {
     led.updateLength(nrofleds);
   }
   if ((ledtype = root["led"]["type"])) {
     led.updateType(ledtype);
     has_white = (ledtype >> 6) != ((ledtype >> 4) & 0x03);
   }

   Bco2alert = root["co2alert"];

   if ((pirInput = root["sensors"]["pir"]["pin"])) {
     pir_found = true;
   } else {
     pir_found = false;
   }

   if (root["clock"]) {
     clock_enabled = root["clock"]["enabled"];
     clock_timezone = root["clock"]["timezone"];
     clock_dst = root["clock"]["dst"];
     clock_enabled = true;
     hourcolor = root["clock"]["hourcolor"];
     minutecolor = root["clock"]["minutecolor"];
     secondcolor = root["clock"]["secondcolor"];
     clock_topled = root["clock"]["topled"];
   }


  f.close();
  SPIFFS.end();
}

boolean setup_wifi() {
  WiFi.persistent(false);
  WiFi.disconnect();
  delay(100);
  WiFi.mode(WIFI_STA);
#if defined(ARDUINO_ARCH_ESP8266)
  WiFi.hostname(Smyname);
#endif
  WiFi.begin(Sssid.c_str(), Spass.c_str());

  // int retries = 0;
  bool ipv6found = false;
  bool ipv4found = false;

  #if LWIP_IPV6 && defined(ARDUINO_ARCH_ESP8266)
  for (bool configured = false; !configured;) {
    for (auto addr : addrList) {
      if (addr.isV6() && !addr.isLocal()) {
        ipv6found = true;
      }
      if (addr.isV4()) {
        ipv4found = true;
      }
      delay(500);
      configured = (ipv4found && ipv6found);
    }
  }
  #else
  while (WiFi.status() != WL_CONNECTED) {
    delay(1000);
    retries++;
    Log.error(F("Wifi.status() = %d"),WiFi.status());
    if (retries > 20) {
      Log.error(F("Cannot connect to %s"),Sssid.c_str());;
      return ipv6found;
    }
  }
  String myIP = String(WiFi.localIP().toString());
  String myMask = String(WiFi.subnetMask().toString());
  Log.verbose("Wifi connected as %s/%s",myIP.c_str(),myMask.c_str());
#endif
  return true;
}

