wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
}

void publish_status() {
  const __FlashStringHelper *status = F("status/sensors");
  String ipv4, ipv6, linkLocal;


  if (si7021_found) mqtt_publish(status,F("si7021_found"));
  if (bme280_found) mqtt_publish(status,F("bme280_found"));
  if (bme680_found) mqtt_publish(status,F("bme680_found"));
  if (tsl2561_found) mqtt_publish(status,F("tsl2561_found"));
  if (voltage_found) mqtt_publish(status,F("voltage_found"));
  if (u8x8_found) mqtt_publish(status,F("u8x8_found"));
  if (veml_found) mqtt_publish(status,F("veml_found"));
  if (lox_found) mqtt_publish(status,F("lox_found"));
  if (tcs_found) mqtt_publish(status,F("tcs_found"));
  if (ads1115_found) mqtt_publish(status,F("ads1115_found"));
  if (ccs811_found) mqtt_publish(status,F("ccs811_found"));
  if (pir_found) mqtt_publish(status,F("pir_found"));
  if (as3935_found) {
    mqtt_publish(status, F("as3935_found"));
    publish_as3935();
  }
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish(F("status/ChipID"),(uint32_t)ESP.getChipId());
  mqtt_publish(F("status/ResetReason"),ESP.getResetReason().c_str());
  mqtt_publish(F("status/SdkVersion"),ESP.getSdkVersion());
  mqtt_publish(F("status/SketchSize"),ESP.getSketchSize());
  mqtt_publish(F("status/CycleCount"),ESP.getCycleCount());
#endif
  mqtt_publish(F("status/CompileTime"), compile_date);

#if LWIP_IPV6 && defined(ARDUINO_ARCH_ESP8266)
for (auto a : addrList) {
  a.isV6() ? a.isLocal() ? linkLocal = a.toString() : ipv6 = a.toString() : ipv4 = a.toString();

  Log.verbose(F("IF=%s index=%d legacy=%d IPv4=%d local=%d hostname='%s' addr= %s"),
                a.ifname().c_str(),
                a.ifnumber(),
                a.isLegacy(),
                a.addr().isV4(),
                a.addr().isLocal(),
                a.ifhostname(),
                a.addr().toString().c_str());


}

mqtt_publish(F("status/ipv4"), ipv4.c_str());
mqtt_publish(F("status/ipv6ll"), linkLocal.c_str());
mqtt_publish(F("status/ipv6"), ipv6.c_str());
#else
  mqtt_publish(F("status/ipv6"),F("disabled"));
#endif
}

void loop_publish_voltage(){
#if defined(ARDUINO_ARCH_ESP8266)
  mqtt_publish(F("voltage"), (float)(ESP.getVcc() / 1000.0));
  mqtt_influx(F("voltage"), (float)(ESP.getVcc() / 1000.0));
#endif
}

void loop_publish_tsl2561() {
  if (tsl2561_found) {
    if (tsl2561.begin()) {
      uint16_t br, ir;
      tsl2561.getLuminosity(&br, &ir);
      uint32_t lux = tsl2561.calculateLux(br, ir);
      mqtt_publish(F("light"),lux);
      mqtt_influx(F("light"),lux);
    } else {
      Log.verbose("loop_publish_tsl2561: Sensor not initialized");
    }
  }
}

void publish_bme280() {
  if (bme280_found) {
    mqtt_publish(F("bme280/tempadjust"),
      (float)bme280.getTemperatureCompensation());
  }
}

void publish_bme680() {
  if (bme680_found) {
    mqtt_publish(F("bme680/tempadjust"),
      (float)bme680TempAdjust);
  }
}

void publish_si7021() {
  if (si7021_found) {
    mqtt_publish(F("si7021/tempadjust"),
      (float)si7021TempAdjust);
  }
}

void loop_publish_bme280() {
  if (bme280_found) {
    mqtt_publish(F("temperature"), bme280.readTemperature());
    mqtt_publish(F("airpressure"), bme280.readPressure() / 100.0F);
    mqtt_publish(F("humidity"), bme280.readHumidity());
    mqtt_influx(F("temperature"), bme280.readTemperature());
    mqtt_influx(F("airpressure"), bme280.readPressure() / 100.0F);
    mqtt_influx(F("humidity"), bme280.readHumidity());
  }
}

#if defined(BME680Bosch)
void checkIaqSensorStatus(void) {
  bme680_found = true;
  if (iaqSensor.status != BSEC_OK) {
    if (iaqSensor.status < BSEC_OK) {
      Log.error(F("BSEC error code %d"), iaqSensor.status);
      bme680_found = false;
    } else {
      Log.warning(F("BSEC warning code %d"), iaqSensor.status);
    }
  }

  if (iaqSensor.status != BME680_OK) {
    if (iaqSensor.status < BME680_OK) {
      Log.error(F("BME680 error code %d"), iaqSensor.bme680Status);
      bme680_found = false;
    } else {
      Log.warning(F("BME680 warning code %d"), iaqSensor.bme680Status);
    }
  }

}

void loop_publish_bme680() {
  if (bme680_found) {
    if (iaqSensor.run()) {
      mqtt_publish(F("temperature"), (float)iaqSensor.temperature);
      mqtt_influx(F("temperature"), (float)iaqSensor.temperature);
      mqtt_publish(F("humidity"), (float)iaqSensor.humidity);
      mqtt_influx(F("humidity"), (float)iaqSensor.humidity);
      mqtt_publish(F("airpressure"), iaqSensor.pressure / 100.0F);
      mqtt_influx(F("airpressure"), iaqSensor.pressure / 100.0F);
      mqtt_influx(F("gasResistance"),(float)iaqSensor.gasResistance);
      mqtt_influx(F("compGasValue"),(float)iaqSensor.compGasValue);
      if (iaqSensor.runInStatus == 1 &&
          iaqSensor.stabStatus == 1) {
        mqtt_publish(F("CO2"), iaqSensor.co2Equivalent);
        mqtt_influx(F("CO2"), iaqSensor.co2Equivalent);
        mqtt_publish(F("airquality"), iaqSensor.iaq);
        mqtt_influx(F("airquality"), iaqSensor.iaq);
        mqtt_influx(F("gasPercentage"),iaqSensor.gasPercentage);
        Log.verbose(F("  co2Ac=%d iaqAc=%d compGasAccuracy=%d gasPercentageAcccuracy=%d"),
          iaqSensor.co2Accuracy,iaqSensor.iaqAccuracy,
          iaqSensor.compGasAccuracy,
          iaqSensor.gasPercentageAcccuracy);
      }  else {
        Log.notice(F("bme60 runIn = %F stab = %F"),
                  iaqSensor.runInStatus,
                  iaqSensor.stabStatus);
        Log.verbose(F("  gasResistance=%F compGasValue=%F gasPercentage=%F compGasAccuracy=%d gasPercentageAcccuracy=%d"),
          iaqSensor.gasResistance,
          iaqSensor.compGasValue,
          iaqSensor.gasPercentage,
          iaqSensor.compGasAccuracy,
          iaqSensor.gasPercentageAcccuracy);
        Log.verbose(F("  rawtemp=%F rawHum=%F"),
          iaqSensor.rawTemperature,
          iaqSensor.rawHumidity
        );
        Log.verbose(F("  temp=%F hum=%F press=%F co2=%F iaq=%F"),
          iaqSensor.temperature,
          iaqSensor.humidity,
          iaqSensor.pressure / 100.0F,
          iaqSensor.co2Equivalent,
          iaqSensor.iaq);
        Log.verbose(F("  co2Ac=%d iaqAc=%d"),
          iaqSensor.co2Accuracy,iaqSensor.iaqAccuracy
        );
      }
    } else {
      checkIaqSensorStatus();
    }
  }


