wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
}
#else // Adafruit
void loop_publish_bme680() {
  if (bme680_found && bme680.performReading()) {
    mqtt_publish(F("temperature"), (float) (bme680.temperature + bme680TempAdjust));
    mqtt_publish(F("airpressure"), bme680.pressure / 100.0F);
    mqtt_publish(F("humidity"), (float)bme680.humidity);
    mqtt_publish(F("airquality"), bme680.gas_resistance / 1000.0F);

    mqtt_influx(F("temperature"), (float)bme680.temperature);
    mqtt_influx(F("airpressure"), bme680.pressure / 100.0F);
    mqtt_influx(F("humidity"), (float)bme680.humidity);
    mqtt_influx(F("airquality"), bme680.gas_resistance / 1000.0F);

  }
}
#endif


void loop_publish_veml6070() {
  if (veml_found) {
    mqtt_publish(F("UV"), (unsigned int) veml.readUV());
    mqtt_influx(F("UV"), (unsigned int) veml.readUV());
  }
}

void loop_publish_gy49() {
  if (gy49_found) {
    mqtt_publish(F("light"),(float)gy49.getLux());
    mqtt_influx(F("light"),(float)gy49.getLux());
  }
}

unsigned int co2ampel(unsigned int co2value) {
  if (Bco2alert) {
    if (co2value <=1000) {
      setled(0,255,0);
    } else if (co2value <= 2000) {
      setled(255,255,0);
    } else {
      setled(255,0,0);
    }

  }
  return co2value;
}

void loop_publish_ccs811() {
  if (ccs811_found) {
    if (ccs.available()) {
      if (!ccs.readData()) {
        mqtt_publish(F("CO2"), co2ampel(ccs.geteCO2()));
        mqtt_publish(F("TVOC"), (unsigned int) ccs.getTVOC());
        mqtt_influx(F("CO2"),co2ampel(ccs.geteCO2()));
        mqtt_influx(F("TVOC"),(unsigned int) ccs.getTVOC());
      } else {
        Log.verbose(F("Error reading data from CCS811"));
      }
    } else {
      Log.verbose(F("No data available at CCS811"));
    }
  }
}


void loop_publish_si7021() {
  if (si7021_found) {
    mqtt_publish(F("temperature"), si7021.readTemperature() + si7021TempAdjust);
    mqtt_publish(F("humidity"), si7021.readHumidity());
    mqtt_influx(F("temperature"), si7021.readTemperature() + si7021TempAdjust);
    mqtt_influx(F("humidity"), si7021.readHumidity());
  }
}

void loop_publish_tcs34725() {
  if (tcs_found) {
    uint16_t r,g,b,c;
    tcs.getRawData(&r,&g,&b,&c);

    Log.verbose(F("TCS Color raw: R=%d G=%d B=%d C=%d"),r,g,b,c);
    uint16_t minval = min(min(r,g),b);
    uint16_t maxval = max(max(r,g),b);

    int d1 = abs(r-g);
    int d2 = abs(r-b);
    int d3 = abs(g-b);

    int maxdist = max(max(d1,d2),d3);
    // int mindist = min(min(d1,d2),d3);

    if (maxdist > 40) {
      r = map(r,minval,maxval,0,255);
      g = map(g,minval,maxval,0,255);
      b = map(b,minval,maxval,0,255);
    }

    setled(r,g,b);
    Log.verbose(F("TCS Color adj: R=%d G=%d B=%d C=%d"),r,g,b,c);
  }
}

static unsigned long lastReportTime = 0;
static bool lastReportState = false;

void loop_publish_motion(bool m) {
  // report motion (true or false)
  // remember when last report was and report only once a minute


//  if (lastReportTime + 60l*1000l > millis())
//    return;

  lastReportTime = millis();
  lastReportState = m;
  mqtt_influx(F("motion"), (unsigned int) m);
  mqtt_publish(F("motion"), (unsigned int) m);
}

int loop_get_lox_distance() {
  if (lox_found) {
    VL53L0X_RangingMeasurementData_t measure;
    lox.rangingTest(&measure);
    if (measure.RangeStatus != 4) {
      // mqtt_influx(F("distance"), measure.RangeMilliMeter);
      return measure.RangeMilliMeter;
    }
  }
  return -1;
}

void lights_on(int dist) {
  bool x = false;

  if (dist == 1406)
    return;

 if ((dist > 0) && (dist < 500))
    x = true;

  if (x == light_on)
    return;

  Log.verbose(F("Lights on? %T %d mm"),x,dist);

  light_on = x;

  if (x) {
    led.setPixelColor(0, led_current_color);
    led.show();
    loop_publish_motion(true);
  } else {
    led_current_color = led.getPixelColor(0);
    led.clear();
    led.show();
    loop_publish_motion(false);
  }

  if (u8x8_found) {
    if (x) {
      u8x8.setContrast(255);
    } else {
      u8x8.setContrast(display_brightness);
    }
  }
}

// read PIR if it exists
void loop_pir() {
  if (pir_found) {
    int pir_old = pirState;
    pirState = digitalRead(pirInput);
    // Low -> Low
    if (pir_old == LOW && pirState == LOW)
      return;
    // Low -> High
    if (pir_old == LOW && pirState == HIGH) {
      loop_publish_motion(true);
    }

    // High -> High
    if (pir_old == HIGH && pirState == HIGH)
      return;
    // High -> Low
    if (pir_old == HIGH && pirState == LOW) {
      loop_publish_motion(false);
    }
  }
}

static int noiseCount=0;
static int totalDisturberCount=0;
static int loopcount = 0;
void loop_as3935() {
  byte watchDogVal = as3935.readWatchdogThreshold();
  if (digitalRead(as3935_input) == HIGH) {
    lightningStatus intReason = (lightningStatus) as3935.readInterruptReg();
    if (intReason == NOISE_TO_HIGH) {
      Log.verbose(F("as3935: noise %d"),++noiseCount);
      byte noiseFloor = as3935.readNoiseLevel();
      if (noiseCount > 2 && noiseFloor < 7) {
        as3935.setNoiseLevel(++noiseFloor);
        Log.verbose(F("as3935: noiseFloor %d"),noiseFloor);
      }
    }
    if (intReason == DISTURBER_DETECT) {
      Log.verbose(F("as3935: disturber %d"),++totalDisturberCount);
      if (totalDisturberCount > 2) {
        if (watchDogVal < 10) {
          as3935.watchdogThreshold(++watchDogVal);
          Log.verbose(F("as3935: watchDogVal %d"),watchDogVal);
        } else {
          as3935.maskDisturber(true);
          Log.verbose(F("as3935: Disturbers masked"));
        }
      }
    }
    if (intReason == LIGHTNING) {
      byte distance = as3935.distanceToStorm();
      uint32_t energy = as3935.lightningEnergy();
      Log.notice(F("as3935: Lightning detected in %d km, energy %u"),distance,energy);
      mqtt_publish(F("lightning/distance"), (uint32_t)distance);
      mqtt_publish(F("lightning/energy"), energy);
      mqtt_influx(F("lightning/distance"), (uint32_t)distance);
      mqtt_influx(F("lightning/energy"), energy);

    }
  }
  if (++loopcount > 10000) {
    loopcount = 0;
    if (totalDisturberCount > 2 && watchDogVal > 2) {
      --totalDisturberCount;
      --watchDogVal;
      as3935.maskDisturber(false);
      as3935.watchdogThreshold(watchDogVal);
      Log.verbose(F("as3935: WatchDogVal %d"),watchDogVal);
    }
  }
}

int rrmap(int in) {
  in += clock_topled;
  if (in < 0)
    return nrofleds + in;
  else if (in >= nrofleds)
    return in - nrofleds;
  else
    return in;
}

uint32_t dimcolor(uint32_t color) {
  // dims color as much as possible
  uint8_t
    r = (uint8_t)(color >> 16),
    g = (uint8_t)(color >> 8),
    b = (uint8_t)(color);

