wtremmel/esp8266-mqtt-sensor-client/src/main.cpp
  uint8_t smallest = min(r,b);
  if (smallest == 0)
    smallest = max(r,b);

  uint8_t sm2 = min(smallest,g);
  if (sm2 == 0)
    sm2 = max(smallest,g);

  if (sm2 == 0)
    return 0;

  return (uint32_t)((r/sm2)<<16) +
    (uint32_t)((g/sm2)<<8) +
    (uint32_t)((b/sm2));

}

uint32_t dimcolor(uint32_t color, uint8_t dimby) {
  // dims only by dimby
  uint8_t
    r = (uint8_t)(color >> 16),
    g = (uint8_t)(color >> 8),
    b = (uint8_t)(color);

  uint32_t ur = r / dimby,
    ug = g / dimby,
    ub = b / dimby;

  if (ur == 0 && r > 0)
    ur = 1;

  if (ug == 0 && g > 0)
    ug = 1;

  if (ub == 0 && b > 0)
    ub = 1;

  return (ur << 16) + (ug << 8) + ub;
}

void display_temperature(int minTemp,int maxTemp, int thisTemp) {
  // not called from loop
  setallleds(0, 0, 0);
  int lastLed=0;

  for (int i=minTemp; i <= 0 && i <=thisTemp; i++) {
    if (i == thisTemp) {
      setled(rrmap(map(i, minTemp, maxTemp, 0, nrofleds-1)),0,0,254,1);
    } else {
      int thisLed = map(i,minTemp,maxTemp,0,nrofleds-1);
      setled(rrmap(thisLed),0,0,1);
      if (thisLed-1 > lastLed)
        setled(rrmap(thisLed-1),0,0,1,1);
      lastLed=thisLed;
    }
    setled(1);
  }
  for (int i=1;i<=maxTemp && i<=thisTemp;i++) {
    if (i == thisTemp) {
      setled(rrmap(map(i,minTemp,maxTemp,0,nrofleds-1)),254,0,0,1);
    } else {
      int thisLed = map(i,minTemp,maxTemp,0,nrofleds-1);
      setled(rrmap(thisLed),1,0,0,1);
      if (thisLed-1 > lastLed)
        setled(rrmap(thisLed-1),1,0,0,1);
      lastLed = thisLed;
    }
    setled(1);
  }
}

void display_temperature(int thisTemp) {
  display_temperature(-10,40,thisTemp);
}

void display_humidity(int thisHum) {
  setallleds(0, 0, 0);
  for (int i=0; i<=thisHum;i++) {
    if (i == thisHum) {
      setled(rrmap(map(i,0,100,0,nrofleds-1)),0,100,100,1);
    } else if (i < thisHum) {
      setled(rrmap(map(i,0,100,0,nrofleds-1)),0,1,1,1);
    }
  }
}

static unsigned long lastDisplay = 0;

void loop_display_time() {
  if ((millis() - lastDisplay) < 1000)
    return;

  if (!rtc_found)
    return;

  lastDisplay = millis();
  rtcnow = rtc.now();

  // hour tick marks
  for (int i = 0; i < nrofleds; i++) {
    if (i % (nrofleds / 12) == 0) {
      setledcolor(i,hourtickcolor,0);
    } else {
      setled(i,0,0,0,0);
    }
  }

  int hour12 = (rtcnow.hour() > 12) ? (rtcnow.hour()-12) : rtcnow.hour();
  // 12
  int hourstart = map(hour12,0,12,0,nrofleds-1);
  int hourwidth = map(2,0,12,0,nrofleds-1) - map(1,0,12,0,nrofleds-1);
  float hourfraction = rtcnow.minute() / 60.0;
  int hourend = hourstart + int((float)hourwidth*hourfraction);

  setledcolor(rrmap(hourend-2),dimcolor(hourcolor),0);
  setledcolor(rrmap(hourend-1),dimcolor(hourcolor),0);
  setledcolor(rrmap(hourend+1),dimcolor(hourcolor),0);
  setledcolor(rrmap(hourend+2),dimcolor(hourcolor),0);

  setledcolor(
    rrmap(map(rtcnow.minute(),0,59,0,nrofleds-1)-1),
    dimcolor(minutecolor),0);
  setledcolor(
    rrmap(map(rtcnow.minute(),0,59,0,nrofleds-1)+1),
    dimcolor(minutecolor),0);

  int hourled = rrmap(hourend),
    minuteled = rrmap(map(rtcnow.minute(),0,59,0,nrofleds-1)),
    secondled = rrmap(map(rtcnow.second(),0,59,0,nrofleds-1));

  int mc;
  if (hourled == minuteled)
    mc = (hourcolor | minutecolor);
  else
    mc = minutecolor;

  setledcolor(hourled,hourcolor,0);
  setledcolor(minuteled,mc,0);
  setledcolor(secondled,secondcolor,0);

  setled(1); // show leds
}

bool loop_display_countdown() {
  int seconds_left = (countdown_until - millis())/1000;
  if (seconds_left <= 0) {
    countdown_mode = false;
    return false;
  }
  // display countdown
  // - seconds moving backwards
  // - number of hours left shown in hour colors
  // - number of minutes left shown in minute colors
  // - if hours and minutes are zero, 60 red leds count down

  // display minutes, overwrite with hours, than seconds

  if (seconds_left < 60) {
    for (int i=0; i < nrofleds;i++) {
      if (i<seconds_left)
        setled(i,255,0,0,0);
      else
        setled(i,0,0,0,0);

    }
  } else if (rtc_found && ((seconds_left + 15) % 30 < 8)) {
    // display time every 30 seconds for 3 seconds
    loop_display_time();
  } else {
    if ((millis() - lastDisplay) < 1000)
      return true;
    else
      lastDisplay=millis();

    int hours_left = seconds_left / (60*60);
    int minutes_left = (seconds_left / 60) - (hours_left * 60);
    int second_tick = seconds_left % 60;
    int i;
    for (i = 0; i < minutes_left; i++) {
      setledcolor(i,minutecolor,0);
    }
    for (;i < nrofleds;i++){
      setledcolor(i,0,0);
    }
    for (i = 0; i < hours_left; i++) {
      setledcolor(i,hourcolor,0);
    }
    setledcolor(second_tick,secondcolor,0);
  }
  setled(1);
  return true;
}

void loop() {
  // put your main code here, to run repeatedly:
  client.loop();

  if (countdown_mode) {
    if (!loop_display_countdown()) {
      // countdown done
      for (int i=0;i<10;i++) {
        setallleds(255, 0, 0);
        delay(50);
        setallleds(0, 0, 0);
        delay(50);
        client.loop();
      }
    }
  }

  else if (clock_enabled)
    loop_display_time();

  if (!client.connected()) {
    now = millis();
    if (now - lastReconnectAttempt > 5000) {
      lastReconnectAttempt = now;
      if (mqtt_reconnect()) {
        lastReconnectAttempt = 0;
      }
    }
  }
  client.loop();

#if defined(ARDUINO_ARCH_ESP32)
  esp_bt_gap_start_discovery(ESP_BT_INQ_MODE_GENERAL_INQUIRY, 10, 10);
#endif

  if (as3935_found) {
    loop_as3935();
  }

  // read sensors and publish values
  if (color_watch)
    loop_publish_tcs34725();
  client.loop();

  if ((millis() - last_transmission) > (transmission_delay * 1000)) {
  // Voltage
    loop_publish_voltage();
    client.loop();
    loop_publish_tsl2561();
    client.loop();
    loop_publish_bme280();
    client.loop();
    loop_publish_bme680();
    client.loop();
    loop_publish_veml6070();
    client.loop();
    loop_publish_gy49();
    client.loop();
    loop_publish_si7021();
    client.loop();
    loop_publish_ccs811();
    client.loop();
    last_transmission = millis();
  }
  client.loop();
  if (pir_found)
    loop_pir();
  client.loop();

  if (lox_found) {
    int distance = loop_get_lox_distance();
    lights_on(distance);
  }
  client.loop();

  if (u8x8_found &&
      light_on &&
      (((millis() - last_display) > (1000*30)) ||
       (display_what == DISPLAY_DISTANCE) ||
       display_refresh
     )
    ) {
    char s[10];
    u8x8.setFont(u8x8_font_amstrad_cpc_extended_r);
    display_refresh = false;
    client.loop();
    switch(display_what) {
      case DISPLAY_TEMPHUM:
        if (bme280_found) {
          char h[10];
          snprintf(s, 9, "%.1f C", bme280.readTemperature());
          snprintf(h, 9, "%.1f %%", bme280.readHumidity());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 1, s);
          u8x8.draw2x2String(1, 4, h);
        }
        break;
      case DISPLAY_TEMPERATURE:
        if (bme280_found) {
          snprintf(s, 9, "%.1f C", bme280.readTemperature());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_HUMIDITY:
        if (bme280_found) {
          snprintf(s, 9, "%.1f %%", bme280.readHumidity());
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_AIRPRESSURE:
        if (bme280_found) {
          snprintf(s, 9, "%d hPa", (int)(bme280.readPressure() / 100));
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
      case DISPLAY_CO2:
          if (ccs811_found && ccs.available()) {
            snprintf(s, 9, "%dppm", ccs.geteCO2());
            u8x8.clearDisplay();
            u8x8.draw2x2String(1, 3, s);
          }
          break;
      case DISPLAY_DISTANCE:
        if (lox_found) {
          int dist = loop_get_lox_distance();
          if (dist >= 0) {
            snprintf(s,9,"%d mm",dist);
          } else {
            snprintf(s,9,"---- mm");
          }
          u8x8.clearDisplay();
          u8x8.draw2x2String(1, 3, s);
        }
        break;
    }
    u8x8.setContrast(display_brightness);
    last_display = millis();
  }
  client.loop();

}
